namespace TagsCloudContainer.Classes;

public class WordFilter : IWordFilter
{
    private string[] excludedWords = 
    {
        "на", "по", "в", "из", "с", "у", "о", "к", "от", "до", "за", "над", "под", "при", "про",
        "и", "а", "но", "или", "что", "как", "чтобы", "если", "то", "же", "ли", "ни",
        "я", "ты", "он", "она", "оно", "мы", "вы", "они", "себя", "мой", "твой", "наш", "ваш",
        "его", "ее", "их", "этот", "тот", "какой", "который", "чей", "сам", "весь", "вся",
        "все", "всё", "каждый", "любой", "никакой", "некоторый",
        "не", "ни", "бы", "ли", "же", "ведь", "вот",  "только", "лишь",
        "именно", "почти", "чуть", "едва", "точно", "прямо",
        "да", "нет", "ах", "ох", "эй", "ну", "вот", "так", "итак", "значит", "однако",
        "вообще", "конечно", "может", "кажется", "пожалуй", "вероятно",
        "был", "была", "было", "были", "есть", "будет", "будут", "стал", "стала", "стало",
        "стали", "это", "того", "том", "тем", "чем", "там", "здесь", "тут", "где", "куда",
        "откуда", "когда", "почему", "зачем", "как", "сколько",
        "один", "два", "три", "четыре", "пять", "первый", "второй", "третий"
    };
    
    public IEnumerable<string> Filter(IEnumerable<string> words)
    {
        return words.Where(x => !excludedWords.Contains(x));
    }
}